# Chapter 6

In [122]:
import pandas as pd
import numpy as np

In [123]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [124]:
df = pd.read_csv('examples/ex1.csv')

In [125]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [126]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [127]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [128]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [129]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [130]:
names = ['a', 'b', 'c', 'd', 'message']

In [131]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [263]:
!cat examples/csv_mindex.csv

parsed = pd.read_csv('examples/csv_mindex.csv', 
                     index_col=['key1', 'key2'])

parsed

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [264]:
In [20]: list(open('examples/ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [268]:
result = pd.read_table('examples/ex3.txt', sep='\\s+')

In [135]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [274]:
!cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [277]:
pd.read_csv('examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [280]:
!cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [281]:
result = pd.read_csv('examples/ex5.csv')

In [282]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [283]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [284]:
result = pd.read_csv('examples/ex5.csv', na_values=['NULL'])

In [285]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [286]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [287]:
pd.read_csv('examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

In [288]:
pd.options.display.max_rows= 10

In [289]:
result = pd.read_csv('examples/ex6.csv')

In [290]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [291]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [292]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [293]:
chunker

In [294]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [295]:
tot = pd.Series([]) 
for piece in chunker:
    tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

In [296]:
tot

key
E    368
X    364
L    346
O    343
Q    340
    ...
5    157
2    152
0    151
9    150
1    146
Length: 36, dtype: object

In [297]:
data = pd.read_csv('examples/ex5.csv')

In [298]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [299]:
data.to_csv('examples/out.csv')

In [300]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [301]:
import sys

In [302]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [303]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [304]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [305]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [306]:
dates = pd.date_range('1/1/2000', periods=7)

In [307]:
ts = pd.Series(np.arange(7), index=dates)

In [308]:
ts.to_csv('examples/tseries.csv')

In [309]:
!cat examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [310]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [311]:
import csv

In [312]:
f = open('examples/ex7.csv')

In [313]:
reader = csv.reader(f)

In [314]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [315]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [316]:
header, values = lines[0], lines[1:]

In [317]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [318]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [319]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar ='"'
    quoting = csv.QUOTE_MINIMAL

In [320]:
with open('examples/ex7.csv') as f:
    reader = csv.reader(f, dialect=my_dialect)
    reader = csv.reader(f, delimiter='|')

In [321]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect) 
    writer.writerow(('one', 'two', 'three')) 
    writer.writerow(('1', '2', '3')) 
    writer.writerow(('4', '5', '6')) 
    writer.writerow(('7', '8', '9'))

In [322]:
#JSON OBJECT EXAMPLE

obj = """
    {"name": "Wes",
     "places_lived": ["United States", "Spain", "Germany"],
     "pet": null,
     "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
                  {"name": "Katie", "age": 38,
                   "pets": ["Sixes", "Stache", "Cisco"]}]
} """

In [323]:
import json

In [324]:
result = json.loads(obj)

In [325]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [326]:
asjson = json.dumps(result)

In [327]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [328]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [329]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [330]:
data = pd.read_json('examples/example.json')

In [331]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [332]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [333]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [334]:
conda install lxml

Channels:
 - defaults
 - conda-forge
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: done

# All requested packages already installed.


Note: you may need to restart the kernel to use updated packages.

In [336]:
pip install beautifulsoup4 html5lib

Requirement already satisfied: beautifulsoup4 in /Users/nathan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (4.12.3)
Requirement already satisfied: html5lib in /Users/nathan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (1.1)
Requirement already satisfied: soupsieve>1.2 in /Users/nathan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from beautifulsoup4) (2.5)
Requirement already satisfied: six>=1.9 in /Users/nathan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /Users/nathan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from html5lib) (0.5.1)
Note: you may need to restart the kernel to use updated packages.

In [337]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [338]:
len(tables)

1

In [339]:
failures = tables[0]

In [340]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [341]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [342]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, Length: 15, dtype: int64

In [343]:
from lxml import objectify

In [344]:
path = 'examples/Performance_MNR.xml'

#path = fd={'examples/mta_perf/Performance_MNR.xml'}

#this worked the first time I tried it but error now.

In [345]:
parsed = objectify.parse(open(path))
root = parsed.getroot()

In [346]:
data = []

In [347]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']

In [348]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [349]:
perf = pd.DataFrame(data)

In [350]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [351]:
dataframe=pd.DataFrame()
#Empty DataFrame

In [352]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [353]:
root

In [354]:
root.get('href')

'http://www.google.com'

In [355]:
root.text

'Google'

In [356]:
frame = pd.read_csv('examples/ex1.csv')

In [357]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [358]:
frame.to_pickle('examples/frame_pickle')

In [359]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [362]:
frame = pd.DataFrame({'a': np.random.randn(100)})

In [366]:
conda install pytables

Channels:
 - defaults
 - conda-forge
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: done

## Package Plan ##

  environment location: /Users/nathan/Library/jupyterlab-desktop/jlab_server

  added / updated specs:
    - pytables


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    blosc-1.21.3               |       h313beb8_0          41 KB
    c-blosc2-2.12.0            |       h7df6c2f_0         266 KB
    hdf5-1.12.1                |       h05c076b_3         5.3 MB
    numexpr-2.8.7              |  py312h0f3ea24_0         134 KB
    py-cpuinfo-9.0.0           |  py312hca03da5_0          60 KB
    pytables-3.9.2             |  py312h905a39b_0         1.5 MB
    zlib-1.2.13                |       h53f4e23_5          78 KB  conda-forge
    zlib-ng-2.0.7              |       h80987f9_0          92 KB
    ------------------------------------------------------------
                                           Total:         7.4 MB

The following NEW packages will be INSTALLED:

  blosc              pkgs/main/osx-arm64::blosc-1.21.3-h313beb8_0
  c-blosc2           pkgs/main/osx-arm64::c-blosc2-2.12.0-h7df6c2f_0
  hdf5               pkgs/main/osx-arm64::hdf5-1.12.1-h05c076b_3
  numexpr            pkgs/main/osx-arm64::numexpr-2.8.7-py312h0f3ea24_0
  py-cpuinfo         pkgs/main/osx-arm64::py-cpuinfo-9.0.0-py312hca03da5_0
  pytables           pkgs/main/osx-arm64::pytables-3.9.2-py312h905a39b_0
  zlib               conda-forge/osx-arm64::zlib-1.2.13-h53f4e23_5
  zlib-ng            pkgs/main/osx-arm64::zlib-ng-2.0.7-h80987f9_0



Downloading and Extracting Packages:
hdf5-1.12.1          | 5.3 MB    |                                       |   0%
pytables-3.9.2       | 1.5 MB    |                                       |   0%

c-blosc2-2.12.0      | 266 KB    |                                       |   0%


numexpr-2.8.7        | 134 KB    |                                       |   0%



zlib-ng-2.0.7        | 92 KB     |                                       |   0%




zlib-1.2.13          | 78 KB     |                                       |   0%





py-cpuinfo-9.0.0     | 60 KB     |                                       |   0%






blosc-1.21.3         | 41 KB     |                                       |   0%



zlib-ng-2.0.7        | 92 KB     | ##################################### | 100%

c-blosc2-2.12.0      | 266 KB    | ####4                                 |  12%
pytables-3.9.2       | 1.5 MB    | ###3                                  |   9%


hdf5-1.12.1          | 5.3 MB    | 8                                     |   2%


numexpr-2.8.7        | 134 KB    | ##################################### | 100%





py-cpuinfo-9.0.0     | 60 KB     | #########9                            |  27%





py-cpuinfo-9.0.0     | 60 KB     | ##################################### | 100%

c-blosc2-2.12.0      | 266 KB    | ###############################1      |  84%
pytables-3.9.2       | 1.5 MB    | ###################1                  |  52%

hdf5-1.12.1          | 5.3 MB    | ####7                                 |  13%






blosc-1.21.3         | 41 KB     | ##############5                       |  39%






blosc-1.21.3         | 41 KB     | ##################################### | 100%




zlib-1.2.13          | 78 KB     | #######6                              |  21%
hdf5-1.12.1          | 5.3 MB    | #########2                            |  25%




zlib-1.2.13          | 78 KB     | ##################################### | 100%





























Preparing transaction: done
Verifying transaction: done
Executing transaction: done

Note: you may need to restart the kernel to use updated packages.

In [367]:
store = pd.HDFStore('mydata.h5')

In [368]:
store['obj1'] = frame

In [369]:
store['obj1_col'] = frame['a']

In [370]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [371]:
store['obj1']

           a
0   0.461202
1   0.850002
2  -1.251015
3   1.680427
4  -1.923453
..       ...
95 -0.387093
96  1.363969
97  0.571691
98  1.078453
99 -1.787668

[100 rows x 1 columns]

In [374]:
store.put('obj2', frame, format='table')

In [375]:
store.select('obj2', where=['index >=10 and index <=15'])

           a
10  0.891881
11 -0.115265
12  0.264849
13 -0.393412
14  0.483646
15 -1.499695

In [376]:
store.close()

In [377]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_61510/1098501470.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_hdf except for the argument 'path_or_buf' will be keyword-only.
  frame.to_hdf('mydata.h5', 'obj3', format='table')

In [379]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.461202
1  0.850002
2 -1.251015
3  1.680427
4 -1.923453